In [1]:
#DATASET : https://www.gov.br/inep/pt-br/acesso-a-informacao/dados-abertos/microdados/enade
#CO_CATEGAD	Código da categoria administrativa da IES	

#1 = Pública Federal
#2 = Pública Estadual
#3 = Pública Municipal
#4 = Privada com fins lucrativos
#5 = Privada sem fins lucrativos
#7 = Especial

#area_curso
#Código da área de enquadramento do curso no Enade
#&CO_GRUPO==1401&
#"21 = Arquitetura e Urbanismo
#72 = Tecnologia em Análiseise e Desenvolvimento de Sistemas
#76 = Tecnologia em Gestão da Produçãoo Industrial
#79 = Tecnologia em Redes de Computadores
#701 = Matemática (Bacharelado)
#702 = Matemática (Licenciatura)
#903 = Letras-Portuguesa (Bacharelado)
#904 = Letras-Portuguesa (Licenciatura)
#905 = Letras-Portuguesa e Inglês (Licenciatura)
#906 = Letras-Portuguesa e Espanhol (Licenciatura)
#1401 = Física (Bacharelado)
#1402 = Física (Licenciatura)
#1501 = Química (Bacharelado)
#1502 = Química (Licenciatura)
#1601 = Ciências Biológicas (Bacharelado)
#1602 = Ciências Biológicas (Licenciatura)
#2001 = Pedagogia (Licenciatura)
#2401 = História (Bacharelado)
#2402 = História (Licenciatura)
#2501 = Artes Visuais (Licenciatura)
#3001 = Geografia (Bacharelado)
#3002 = Geografia (Licenciatura)
#3201 = Filosofia (Bacharelado)
#3202 = Filosofia (Licenciatura)
#3502 = Educaçãoo Física (Licenciatura)


#CO_REGIAO_CURSO	Código da região de funcionamento do curso	
#1 = Norte
#2 = Nordeste
#3 = Sudeste
#4 = Sul
#5 = Centro-Oeste

#NU_IDADE	Idade do inscrito em 26/11/2017	min = 10  max = 95

#TP_SEXO	Tipo de sexo	M = Masculino #F = Feminino  


#CO_TURNO_GRADUACAO	Código do turno de graduação	
#1 = Matutino
#2 = Vespertino
#3 = Integral
#4 = Noturno

#NT_GER	Nota bruta da prova - Media ponderada da formação geral (25%) e componente específico (75%). 
#(valor de 0 a 100)	

#QE_I01	Qual o seu estado civil?	

#A = Solteiro(a).
#B = Casado(a).
#C = Separado(a) judicialmente/divorciado(a).
#D = Viúvo(a).
#E = Outro.

#QE_I02	Qual a sua cor ou raça?	

#A = Branca.
#B = Preta.
#C = Amarela.
#D = Parda.
#E = Indígena.
#F = Não quero declarar.

#QE_I08	
#Qual a renda total de sua família, incluindo seus rendimentos?	

#A = Até 1,5 salários mínimo (atÃ© R$ 1.405,50).
#B = De 1,5 a 3 salários mínimos (R$ 1.405,51 a R$ 2.811,00).
#C = De 3 a 4,5 salários mínimos (R$ 2.811,01 a R$ 4.216,50).
#D = De 4,5 a 6 salários mínimos (R$ 4.216,51 a R$ 5.622,00).
#E = De 6 a 10 salários mínimos (R$ 5. 622,01 a R$ 9.370,00).
#F = De 10 a 30 salários mínimos (R$ 9.370,01 a R$ 28.110,00).
#G = Acima de 30 salários mínimos (mais de R$ 28.110,00).

#QE_I21	Alguém em sua família concluiu um curso superior?

#A = Sim.
#B = Não.

#QE_I23 Quantas horas por semana, aproximadamente, você dedicou aos estudos, excetuando as horas de aula?

#A = Nenhuma, apenas assisto as aulas.
#B = De uma a três.
#C = De quatro a sete.
#D = De oito a doze.
#E = Mais de doze.

In [318]:
#----------------------importando os dados---------------------------------------------------------
import pandas as pd
import numpy as np
import plotly.graph_objects as go
df = pd.read_csv("microdados_enade_2017.txt",
                 sep = ";", header = 0, decimal=',',
                 dtype = {"DS_VT_ACE_OFG": str,"DS_VT_ACE_OCE": str}
                )

G:\ANACONDA\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (29,31) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.head()

,NU_ANO,CO_IES,CO_CATEGAD,CO_ORGACAD,CO_GRUPO,CO_CURSO,CO_MODALIDADE,CO_MUNIC_CURSO,CO_UF_CURSO,CO_REGIAO_CURSO,...,QE_I72,QE_I73,QE_I74,QE_I75,QE_I76,QE_I77,QE_I78,QE_I79,QE_I80,QE_I81
0,2017,1,1,10028,5710,3,1,5103403,51,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2017,1,1,10028,5710,3,1,5103403,51,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2017,1,1,10028,5710,3,1,5103403,51,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2017,1,1,10028,5710,3,1,5103403,51,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2017,1,1,10028,5710,3,1,5103403,51,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
print("Número de linhas: ",df.shape[0],"\nNúmero de colunas: ",df.shape[1], "\n\nContagem de tipos de coluna:","\n",df.dtypes.value_counts())

Número de linhas:  537436
Número de colunas:  150

Contagem de tipos de coluna:
 float64    73
object     56
int64      21
dtype: int64

In [39]:
#----------------------feature engineering---------------------------------------------------------
#Filtrando apenas as colunas que iremos utilizar
df_f = df[["CO_GRUPO", "CO_REGIAO_CURSO", "NU_IDADE", "TP_SEXO", "CO_TURNO_GRADUACAO", "NT_GER", 
           "QE_I01", "QE_I02","QE_I08","QE_I21","QE_I23", "NT_OBJ_FG", "NT_OBJ_CE"]].copy()
print("Número de linhas: ",df_f.shape[0],"\nNúmero de colunas: ",df_f.shape[1],
      "\n\nContagem de tipos de coluna:","\n",df_f.dtypes.value_counts())

Número de linhas:  537436
Número de colunas:  13

Contagem de tipos de coluna:
 object     6
float64    4
int64      3
dtype: int64

In [40]:
#tipo de cada coluna
df_f.dtypes

CO_GRUPO                int64
CO_REGIAO_CURSO         int64
NU_IDADE                int64
TP_SEXO                object
CO_TURNO_GRADUACAO    float64
NT_GER                float64
QE_I01                 object
QE_I02                 object
QE_I08                 object
QE_I21                 object
QE_I23                 object
NT_OBJ_FG             float64
NT_OBJ_CE             float64
dtype: object

In [41]:
#dicionário:
#QE_I01	Qual o seu estado civil?	
#CO_GRUPO Curso(Matemática, estatística, psicologia..)
#CO_REGIAO_CURSO (Norte, nordeste, sul..)
#TP_SEXO (Masculino/Feminino)

In [42]:
#Agrupamento por curso
df_fg = pd.DataFrame(df_f.CO_GRUPO.value_counts())
df_fg.reset_index(level=0, inplace=True)
df_fg = df_fg.rename(
    columns = {"index":"Código do Grupo","CO_GRUPO":"Contagem de Estudantes"}
).sort_values(
    "Contagem de Estudantes", axis=0, ascending=False
)
print("Abaixo os 20 grupos com maior concentração de estudantes:\n\n",df_fg.head(20))

Abaixo os 20 grupos com maior concentração de estudantes:

     Código do Grupo  Contagem de Estudantes
0              2001                  132754
1              5710                   52798
2              3502                   34763
3                21                   27026
4              6208                   25714
5              2402                   18531
6              5902                   18422
7              1602                   17381
8              5806                   16370
9               904                   15613
10             4006                   14990
11              702                   13410
12               72                   12538
13             3002                   11220
14             4004                   10186
15             6307                    8826
16             6306                    8699
17             1601                    7971
18              905                    7963
19             6008                    6921

In [43]:
#Filtrando os dados só para os profissionais de análise e desenvolvimento de sistemas (t.i)
df_f = df_f[df_f["CO_GRUPO"] == 72]

In [44]:
#----------------------aplicando dicionario nas features---------------------
def estado_civil_str(estado_civil):
    if estado_civil == "A":
        return "Solteiro(a)"
    elif estado_civil == "B":
        return "Casado(a)"
    elif estado_civil == "C":
        return "Separado(a)"
    elif estado_civil == "D":
        return "Viúvo(a)"
    else: 
        return "Outro"
    
df_f["ESTADO_CIVIL"] = df_f["QE_I01"].apply(estado_civil_str)
print(df_f["ESTADO_CIVIL"].value_counts(),"\n\n",df_f["QE_I01"].value_counts())

Solteiro(a)    7827
Outro          2406
Casado(a)      2087
Separado(a)     207
Viúvo(a)         11
Name: ESTADO_CIVIL, dtype: int64

 A    7827
B    2087
E     327
C     207
D      11
Name: QE_I01, dtype: int64

In [45]:
def regiao_str(cod_regiao):
    if cod_regiao == 1:
        return "Norte"
    elif cod_regiao == 2:
        return "Nordeste"
    elif cod_regiao == 3:
        return "Sudeste"
    elif cod_regiao == 4:
        return "Sul"
    elif cod_regiao == 5:
        return "Centro-Oeste"
    else: 
        return "CODIGO INVALIDO"
    
df_f["REGIAO"] = df_f["CO_REGIAO_CURSO"].apply(regiao_str)
print(df_f["REGIAO"].value_counts(),"\n\n",df_f["CO_REGIAO_CURSO"].value_counts())

Sudeste         7538
Sul             2583
Nordeste        1117
Centro-Oeste     911
Norte            389
Name: REGIAO, dtype: int64

 3    7538
4    2583
2    1117
5     911
1     389
Name: CO_REGIAO_CURSO, dtype: int64

In [46]:
def sexo_str(cod_sexo):
    if cod_sexo == "M":
        return "Masculino"
    elif cod_sexo == "F":
        return "Feminino"
    else: 
        return "CODIGO INVALIDO"
    
df_f["SEXO"] = df_f["TP_SEXO"].apply(sexo_str)
print(df_f["SEXO"].value_counts(),"\n\n",df_f["TP_SEXO"].value_counts())

Masculino    10834
Feminino      1704
Name: SEXO, dtype: int64

 M    10834
F     1704
Name: TP_SEXO, dtype: int64

In [47]:
def hestudo_str(hs_estudo):
    if hs_estudo == "A":
        return "Nenhuma, apenas assisto às aulas"
    elif hs_estudo == "B":
        return "De uma a três"
    elif hs_estudo == "C":
        return "De quatro a sete"
    elif hs_estudo == "D":
        return "De oito a doze"
    elif hs_estudo == "E":
        return "Mais de doze"
    else: 
        return "CODIGO INVALIDO"
    
df_f["HESTUDOS"] = df_f["QE_I23"].apply(hestudo_str)
print(df_f["HESTUDOS"].value_counts(),"\n\n",df_f["QE_I23"].value_counts())

De uma a três                       4496
De quatro a sete                    2908
CODIGO INVALIDO                     2079
De oito a doze                      1119
Mais de doze                        1060
Nenhuma, apenas assisto às aulas     876
Name: HESTUDOS, dtype: int64

 B    4496
C    2908
D    1119
E    1060
A     876
Name: QE_I23, dtype: int64

In [48]:
#Investigando o "CODIGO INVALIDO", são linhas com Nan no campo
df_f[df_f["HESTUDOS"]=="CODIGO INVALIDO"]["QE_I23"].unique()

array([nan], dtype=object)

In [174]:
df_t = df_f.drop(["QE_I01","CO_REGIAO_CURSO","TP_SEXO","QE_I23"], axis=1)
df_t.reset_index(inplace = True, drop = True)
df_t.head()

,CO_GRUPO,NU_IDADE,CO_TURNO_GRADUACAO,NT_GER,QE_I02,QE_I08,QE_I21,NT_OBJ_FG,NT_OBJ_CE,ESTADO_CIVIL,REGIAO,SEXO,HESTUDOS
0,72,21,1.0,21.7,D,A,B,25.0,15.0,Solteiro(a),Sudeste,Feminino,De quatro a sete
1,72,24,1.0,29.7,B,C,A,62.5,20.0,Solteiro(a),Sudeste,Feminino,De uma a três
2,72,30,4.0,35.3,D,A,B,37.5,35.0,Viúvo(a),Sudeste,Masculino,De oito a doze
3,72,23,1.0,13.1,D,F,B,25.0,10.0,Solteiro(a),Sudeste,Masculino,De quatro a sete
4,72,20,1.0,27.5,A,B,A,37.5,20.0,Solteiro(a),Sudeste,Masculino,De uma a três

In [175]:
print("Número de linhas: ",df_t.shape[0],"\nNúmero de colunas: ",df_t.shape[1],
      "\n\nContagem de tipos de coluna:","\n",df_t.dtypes.value_counts(),"\n\n", df_t.dtypes)

Número de linhas:  12538
Número de colunas:  13

Contagem de tipos de coluna:
 object     7
float64    4
int64      2
dtype: int64

 CO_GRUPO                int64
NU_IDADE                int64
CO_TURNO_GRADUACAO    float64
NT_GER                float64
QE_I02                 object
QE_I08                 object
QE_I21                 object
NT_OBJ_FG             float64
NT_OBJ_CE             float64
ESTADO_CIVIL           object
REGIAO                 object
SEXO                   object
HESTUDOS               object
dtype: object

In [176]:
#----------------------analise descritiva---------------------------------------------------------
df_t.describe()

,CO_GRUPO,NU_IDADE,CO_TURNO_GRADUACAO,NT_GER,NT_OBJ_FG,NT_OBJ_CE
count,12538.0,12538.000000,12538.000000,9743.000000,9743.000000,9743.000000
mean,72.0,27.502951,3.359627,40.172842,49.187878,42.037360
std,0.0,7.059713,1.075793,12.910787,20.844402,15.773229
min,72.0,18.000000,1.000000,0.000000,0.000000,0.000000
25%,72.0,22.000000,3.000000,31.100000,37.500000,30.000000
50%,72.0,26.000000,4.000000,39.600000,50.000000,40.000000
75%,72.0,31.000000,4.000000,48.900000,62.500000,55.000000
max,72.0,73.000000,4.000000,90.600000,100.000000,95.000000

In [177]:
df_t[["ESTADO_CIVIL","REGIAO","SEXO","HESTUDOS"]].describe()

       ESTADO_CIVIL   REGIAO       SEXO       HESTUDOS
count         12538    12538      12538          12538
unique            5        5          2              6
top     Solteiro(a)  Sudeste  Masculino  De uma a três
freq           7827     7538      10834           4496

In [178]:
print(df_t["ESTADO_CIVIL"].value_counts(),"\n\n",df_t["REGIAO"].value_counts(),
      "\n\n",df_t["SEXO"].value_counts(),"\n\n",df_t["HESTUDOS"].value_counts())

Solteiro(a)    7827
Outro          2406
Casado(a)      2087
Separado(a)     207
Viúvo(a)         11
Name: ESTADO_CIVIL, dtype: int64

 Sudeste         7538
Sul             2583
Nordeste        1117
Centro-Oeste     911
Norte            389
Name: REGIAO, dtype: int64

 Masculino    10834
Feminino      1704
Name: SEXO, dtype: int64

 De uma a três                       4496
De quatro a sete                    2908
CODIGO INVALIDO                     2079
De oito a doze                      1119
Mais de doze                        1060
Nenhuma, apenas assisto às aulas     876
Name: HESTUDOS, dtype: int64

In [179]:
#frequencia simples e frequencia relativa simples das distintas regioes(%)
print(df_t["REGIAO"].value_counts(),"\n\n",
(df_t["REGIAO"].value_counts()/df_t["REGIAO"].value_counts().sum())*100)

Sudeste         7538
Sul             2583
Nordeste        1117
Centro-Oeste     911
Norte            389
Name: REGIAO, dtype: int64

 Sudeste         60.121231
Sul             20.601372
Nordeste         8.908917
Centro-Oeste     7.265912
Norte            3.102568
Name: REGIAO, dtype: float64

In [180]:
#frequencia simples e frequencia relativa simples das distintas regioes(%)
print(df_t["ESTADO_CIVIL"].value_counts(),"\n\n",
(df_t["ESTADO_CIVIL"].value_counts()/df_t["ESTADO_CIVIL"].value_counts().sum())*100)

Solteiro(a)    7827
Outro          2406
Casado(a)      2087
Separado(a)     207
Viúvo(a)         11
Name: ESTADO_CIVIL, dtype: int64

 Solteiro(a)    62.426224
Outro          19.189663
Casado(a)      16.645398
Separado(a)     1.650981
Viúvo(a)        0.087733
Name: ESTADO_CIVIL, dtype: float64

In [181]:
#distribuicao das notas por estado civil
df_t[["ESTADO_CIVIL","NT_OBJ_FG"]].groupby(df_t["ESTADO_CIVIL"]).describe()

             NT_OBJ_FG
                 count       mean        std   min    25%   50%    75%    max
ESTADO_CIVIL
Casado(a)       1850.0  50.229730  21.803053   0.0  37.50  50.0  62.50  100.0
Outro            410.0  48.262195  21.827035   0.0  37.50  50.0  62.50  100.0
Separado(a)      183.0  50.409836  23.252881   0.0  37.50  50.0  62.50  100.0
Solteiro(a)     7289.0  48.955618  20.470860   0.0  37.50  50.0  62.50  100.0
Viúvo(a)          11.0  42.045455  17.022712  12.5  31.25  37.5  56.25   62.5

In [182]:
df_t.isnull().sum()

CO_GRUPO                 0
NU_IDADE                 0
CO_TURNO_GRADUACAO       0
NT_GER                2795
QE_I02                2079
QE_I08                2079
QE_I21                2079
NT_OBJ_FG             2795
NT_OBJ_CE             2795
ESTADO_CIVIL             0
REGIAO                   0
SEXO                     0
HESTUDOS                 0
dtype: int64

In [183]:
#excluindo linhas com valores nulos
df_t = df_t.dropna(axis=0, how='any')
df_t.isnull().sum()

CO_GRUPO              0
NU_IDADE              0
CO_TURNO_GRADUACAO    0
NT_GER                0
QE_I02                0
QE_I08                0
QE_I21                0
NT_OBJ_FG             0
NT_OBJ_CE             0
ESTADO_CIVIL          0
REGIAO                0
SEXO                  0
HESTUDOS              0
dtype: int64

In [184]:
#quantas linhas foram excluidas? %?
print(df_f.shape[0]-df_t.shape[0],"\n\n",
(df_f.shape[0]-df_t.shape[0])/df_f.shape[0]*100)

2902

 23.145637262721326

In [185]:
df_t["NT_OBJ_FG"].describe()

count    9636.000000
mean       49.229452
std        20.826908
min         0.000000
25%        37.500000
50%        50.000000
75%        62.500000
max       100.000000
Name: NT_OBJ_FG, dtype: float64

In [224]:
#MEDIANA MANUAL
el_md = df_t["NT_OBJ_FG"].count()/2
el_md1 = pd.DataFrame(df_t["NT_OBJ_FG"].sort_values())[(int(el_md)-1):int(el_md)].values
el_md2 = pd.DataFrame(df_t["NT_OBJ_FG"].sort_values())[(int(el_md)):int(el_md)+1].values
print("mediana: ",int(((el_md1+el_md2)/2)))

mediana:  50

In [310]:
tbl_moda = pd.DataFrame(df_t["NT_OBJ_FG"].value_counts()).sort_values(
    "NT_OBJ_FG", axis=0, ascending=False
)
tbl_moda.reset_index(level=0, inplace=True)
tbl_moda = tbl_moda.rename(
    columns = {"index":"Nota",
               "NT_OBJ_FG":"Contagem de Estudantes"})
moda = tbl_moda["Nota"][0:1].values
print("moda: ",int(moda))

moda:  50

In [232]:
#frequencia simples e frequencia relativa simples das distintas regioes(%)
print(df_t["NT_OBJ_FG"].value_counts(),"\n\n",
(df_t["NT_OBJ_FG"].value_counts()/df_t["NT_OBJ_FG"].value_counts().sum())*100)

50.0     2219
37.5     1906
62.5     1858
25.0     1233
75.0     1143
12.5      525
87.5      463
0.0       167
100.0     122
Name: NT_OBJ_FG, dtype: int64

 50.0     23.028227
37.5     19.779992
62.5     19.281860
25.0     12.795766
75.0     11.861768
12.5      5.448319
87.5      4.804898
0.0       1.733084
100.0     1.266086
Name: NT_OBJ_FG, dtype: float64

In [326]:
consolidado_notas = {'Qtd Notas': df_t["NT_OBJ_FG"].count(),
                     'media': df_t["NT_OBJ_FG"].mean(), 
                     'mediana': float(((el_md1+el_md2)/2)),
                     'moda': moda
                }
consolidado_notas = pd.DataFrame(data = consolidado_notas)
consolidado_notas

   Qtd Notas      media  mediana  moda
0       9636  49.229452     50.0  50.0

In [325]:
#Coefieciente de assimetria de pearson<0, logo terá assimetria negativa e 
#concentração a direita dos maiores valores.
#k>0, leptocúrtica
#k=0, Mesocúrtica
#k<0, Platicúrtica
#Consideramos então platicúrtica.

from scipy.stats import skew, kurtosis
print("coeficiente de assimetria: ",skew(df_t["NT_OBJ_FG"]),"\n\n",
"curtose: ",kurtosis(df_t["NT_OBJ_FG"]))

coeficiente de assimetria:  -0.008377120321349315

 curtose:  -0.37234018522257184